app/controllers/application_controller.rb

    def load_product
        @product =Cart.find(session[:product])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]