app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "pppppp"], ["description", "ssssssssss"], ["price", "23.45"], ["created_at", "2022-04-04 03:42:37.741689"], ["updated_at", "2022-04-04 03:42:37.741689"]]

  def update
    respond_to do |format|
      if @cart.update(cart_params)
---
UPDATE "carts" SET "description" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["description", "gqdewsgdhsgdfg"], ["updated_at", "2022-04-04 14:15:26.551241"], ["id", 28]]

  def destroy
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 33]]